[
    {
        "post": "'Tis the Season@french_canadian_carpenter",
        "comments": "Scott Clark: I ruined a previous Ego blower doing this. It sucked snow in the back side, I felt a little shock (like a static shock) and it died. Had to buy a new one."
    },
    {
        "post": "Snow Ready! @krugerconstruction",
        "comments": "Amy Branson: I’d need western PA to get more snow. Fingers crossed "
    },
    {
        "post": "Heavy wet snow? No problem  @french_canadian_carpenter",
        "comments": "Gerry Barnaby: I made the switch to EGO 2 stage a couple of years ago ( sold my Ariens,) and have been thrilled with its performance. I live in Michigan and we get all manner of types of snow from wet to fluffy..."
    },
    {
        "post": "Heads up! Save BIG on select top-rated tools from the #1 rated brand in cordless outdoor power. The EGO Black Friday Sale starts 11/24!",
        "comments": "Jayson Mickel: What about snow blowers 2 stage"
    },
    {
        "post": "Tighten the chain with the twist of a dial Paul Sanderson",
        "comments": "Jenny Genova: I absolutely love my EGO chainsaw. We've cut approximately 5 full cords of wood with it, mostly maple and mostly 12 inches and smaller. We've had zero problems with the saw."
    },
    {
        "post": "Gentle reminder  @phil.vision",
        "comments": "Jeremy Brown: As someone with way too many leaves to mulch them all and no woods to blow them into… I really wish EGO made an electric direct-bagging leaf vac/mulcher.  Or perhaps an attachment for the mower.  I would buy one in a heartbeat!"
    },
    {
        "post": "Visit the EGO booth at the @equip exposition this week as EGO Commercial unveils its fully scalable commercial charging solution. Maximize uptime and grow your business with the powerful tools and smart tech of EGO Commercial.",
        "comments": "Thomas Zieba: The only thing I’m interested in commercially is the charging solutions. Would be nice to have some for those of us not using enclosed landscaping trailers."
    },
    {
        "post": "Chainsaw Time. @cutitzero @sanantony1",
        "comments": "Lyndol Wilkins: Wow!"
    },
    {
        "post": "Zero tangles@TOOLSbyDesign",
        "comments": "David France: I would not rebuy it as is. Need to improve the string out feed. Its very slow to let out string. Maybe a button to let it out?"
    },
    {
        "post": "Have you tried cruise control?@AllynHane",
        "comments": "Richard Miles: Amazing technology and products. Hopefully MSRPs for your riding mowers will come down in the future! "
    },
    {
        "post": "Carbon fiber shaft is a huge win@krugerconstruction",
        "comments": "Becky Brooks: I keep asking for one every year for Mother’s Day, so far no luck"
    },
    {
        "post": "Fall is right around the corner @ToolsInAction",
        "comments": "Zach French: Got one and LOVE it!"
    },
    {
        "post": "STAY TUNED  https://bit.ly/44rV23a",
        "comments": "Thomas Doyle: Do they mulch right out of the box or do they require a blade change?"
    },
    {
        "post": "We hear you EGO Fans! COMING SOON  Check it out! https://bit.ly/3Pd6SKg",
        "comments": "Alan Steinhauser: I was hoping to see the addition of a reel mower. Maybe next time."
    },
    {
        "post": "When Power meets Precision John Paul",
        "comments": "André Albert: And this!!"
    },
    {
        "post": "Chill Mode on@jrlevingston",
        "comments": "Henning Klingenbjerg: That's great, but what about the leaf vacuum & mulcher? Leaf season is fast approaching."
    },
    {
        "post": "Can the Z6 zero turn handle heavy brush? Yes. @TOOLSbyDesign",
        "comments": "The Plumberlorian  · Follow: Heat index was 110 degree F yesterday "
    },
    {
        "post": "Summer Essential@ToolsInAction",
        "comments": "Tim Alleman: Had mine for about 5 months and I love it.Best thing I ever did was make the switch from gas. I also have the Gen 1 push mower from 6 years ago with the 7.5 Ah battery. Still works great."
    }
]